tutorials/lesInterFoam/nozzleFlow2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    axis
    {
        type            empty;
    }

    inlet           
    {
        type            fixedValue;
        value           uniform (460 0 0);
    }

    wall            
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    atmosphere      
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    front         
    {
        type            wedge;
    }

    back         
    {
        type            wedge;
    }
}

// ************************************************************************* //
